app/controllers/payments_controller.rb

INSERT INTO "payments" ("subscriber_id", "amount", "payment_date", "notes", "created_at", "updated_at") VALUES (1, 950.0, '2026-06-26', '', '2026-06-26 17:05:52.631716', '2026-06-26 17:05:52.631716') RETURNING "id"
---
  def create
    @payment = @subscriber.payments.build(payment_params)
    if @payment.save

SELECT "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = 1 LIMIT 1
---
  def set_subscriber
    @subscriber = Subscriber.find(params[:subscriber_id])