app/controllers/subscribers_controller.rb

  def index
    @subscribers = Subscriber.all.order(:name)
---
SELECT "subscribers".* FROM "subscribers" ORDER BY "subscribers"."name" ASC

  def show
    @payments = @subscriber.payments.order(payment_date: :desc)
---
SELECT "payments".* FROM "payments" WHERE "payments"."subscriber_id" = 1 ORDER BY "payments"."payment_date" DESC LIMIT 1

  def create
    @subscriber = Subscriber.new(subscriber_params)
    if @subscriber.save
---
INSERT INTO "subscribers" ("name", "email", "phone", "next_payment", "active", "created_at", "updated_at") VALUES ('Nestor Alvarez', 'nexthor@gmail.com', '8114189105', '2026-07-01', TRUE, '2026-06-26 17:03:07.387308', '2026-06-26 17:03:07.387308') RETURNING "id"

  def update
    if @subscriber.update(subscriber_params)
---
UPDATE "subscribers" SET "next_payment" = '2026-07-01', "updated_at" = '2026-06-26 17:06:27.589815' WHERE "subscribers"."id" = 1

  def set_subscriber
    @subscriber = Subscriber.find(params[:id])
---
SELECT "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = 1 LIMIT 1