app/models/payment.rb

  def update_subscriber
    subscriber.update(
      next_payment: payment_date >> 1,
      active: true
    )
---
UPDATE "subscribers" SET "next_payment" = '2026-07-26', "updated_at" = '2026-06-26 17:05:52.638544' WHERE "subscribers"."id" = 1